import 'package:flutter/material.dart';
import 'package:jaray_police_web/constant.dart';

class Paramt {
  int? id;

  Paramt({
    this.id,
  });
}

// class Form {
//   int id;
//   List<String> h2;
//   String h3;
//   String widget1;
//   Widget widget2;
//   List<String> choice;
//   String choosed = "";
//   String comment_1 = "";
//   String comment_2 = "";
//   String comment_3 = "";

//   Form({
//     required this.id,
//     required this.h2,
//     required this.h3,
//     required this.widget1,
//     required this.widget2,
//     required this.choice,
//   });
// }

class Score_choice {
  double score;
  String txt;

  Score_choice({
    required this.score,
    required this.txt,
  });
}

class Form_ {
  int id;
  Widget header;
  List<Widget> widgets_1;
  List<Widget> widgets_2;
  List<Score_choice> choice;
  Score_choice choosed = Score_choice(score: 10.0, txt: "");
  String comment_1 = "";
  String comment_2 = "";
  String comment_3 = "";

  Form_({
    required this.id,
    required this.header,
    required this.widgets_1,
    required this.widgets_2,
    required this.choice,
  });
}

Text h2(String text, String utext) {
  double fontSize = 16;
  return Text.rich(
    TextSpan(
      text: text,
      style: TextStyle(
        fontSize: fontSize,
        color: Colors.black,
      ),
      children: [
        TextSpan(
          text: utext,
          style: TextStyle(
            fontSize: fontSize,
            color: Colors.black,
            decoration: TextDecoration.underline,
          ),
        ),
      ],
    ),
  );
}

Text h3(String text) {
  double hFontsize = 16;
  return Text(
    text,
    style: TextStyle(
      fontSize: hFontsize,
      color: Colors.black,
    ),
  );
}

Text formText(String text) {
  return Text(
    text,
    style: TextStyle(fontSize: 16),
  );
}

Row formRow(String txt1, String txt2) {
  return Row(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      Text(txt1),
      Expanded(
        child: Text(txt2),
      ),
    ],
  );
}

Row formRowColumn(String txt1, String txt2, String txt3) {
  return Row(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      Text(txt1),
      Expanded(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(txt2),
            Text(txt3),
          ],
        ),
      ),
    ],
  );
}

List<Form_> form_list = [
  Form_(
    id: 1,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.1 คำสั่งหัวหน้าสถานีตำรวจ เรื่อง การจัดตำรวจร้อยเวร 20/จราจรร่วมพนักงานสอบสวนตรวจที่เกิดเหตุ อบถ. (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "คำสั่งมีความครบถ้วน สมบูรณ์ เป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีคำสั่ง ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่ง (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 2,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.2 รายงานการสืบสวน อบถ. (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          ตรวจสอบการกรอกข้อมูลในแบบสอบสวน อบถ.ตร. กำหนด"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "สุ่มตรวจการกรอกข้อมูลในแบบ อบถ. กรอกครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีการกรอกข้อมูล ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่กรอก/ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 3,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.3 ภาพถ่ายสถานที่เกิดเหตุ และภาพถ่ายปัจจัยสาเหตุ อบถ. (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt:
            "มีภาพถ่ายที่เกิดเหตุครบองค์ประกอบ (คน,ถนน/ส่วนควบ,ยานพาหนะ) (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีภาพถ่าย ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี/ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 4,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText("          มีคำสั่งแต่งตั้งคณะทำงาน อบถ.สน./สภ. (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีคำสั่งและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.25,
        txt: "มีคำสั่งแต่ไม่เป็นปัจจุบัน (0.25 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่ง (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 5,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานการประชุม อบถ. สน./สภ. อย่างน้อย 1 ครั้ง/เดือน โดยมีมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย ในรายงานการประชุม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วนทุกเดือน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 6,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานการประชุม อบถ. ภายนอกหน่วย ร่วมกับภาคีเครือข่ายที่เกี่ยวข้องในพื้นที่ สน./สภ. ประจำเดือนหรือช่วงเวลาที่เหมาะสม ตามโครงสร้างของคณะอนุกรรมการบังคับใช้กฎหมายของ ปภ. จังหวัด (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วนทุกเดือน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 7,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText("          ภาพถ่ายการจัดประชุม อบถ. (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีภาพถ่าย (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีภาพถ่าย (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 8,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          สัมภาษณ์เจ้าหน้าที่ผู้ปฏิบัติงาน ว่ามีการประชุม และทราบการวิเคราะห์ปัญหาสาเหตุและมีมาตรการหรือไม่ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีมาตรการและทราบครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "ทราบไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่ทราบ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 9,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          คำสั่งตั้งด่านหรือกวดขันจับกุมพร้อมระบุเหตุผลซึ่งเป็นมติจากที่ประชุม อบถ. (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 10,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          สถิติการจับกุมข้อหาต่างๆ และการไม่จัดทำ พ.ร.บ.คุ้มครองฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 11,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รณรงค์ ประชาสัมพันธ์ ขอความร่วมมือ หน่วยงาน องค์กร ทั้งภาครัฐและเอกชน สถานประกอบการและชุมชน ให้ใช้มาตรการองค์กร เกี่ยวกับมาตรการที่ช่วยให้เกิดความปลอดภัยในการขับรถ เช่น เมาไม่ขับ ขับไม่โทร การสวมหมวกนิรภัย/การคาดเข็มขัดนิรภัย เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 12,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การร่วมมือกับหน่วยงานต่างๆ ในการออกมาตรการแก้ไขและป้องกันร่วมกัน เช่น บริษัท/สถานศึกษา/โรงงาน/หน่วยงานราชการ ออกระเบียบให้ใส่หมวกนิรภัย เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 13,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          คำสั่งมาตรการการแข่งรถในทาง (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 14,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานผลสำรวจจุดเสี่ยง ระบุประเภทของถนน หมายเลขถนน ชัดเจน พร้อมการวิเคราะห์เหตุผลความเสี่ยงประกอบรายงาน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 15,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีภาพถ่ายสภาพถนนและส่วนควบ เช่น ข้อมูลด้านวิศวกรรมจราจร ไฟ เครื่องหมาย ประกอบการรายงานผล (ก่อน-หลังการแก้ไขเฉพาะงานในหน้าที่ตำรวจ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 16,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานผลการสำรวจสภาพแวดล้อมที่เสี่ยงอันตราย อันเป็นปัจจัยทำให้เกิดอุบัติเหตุ เช่น มีฝูงวัวควายข้ามถนน ไม่มีไฟส่องสว่างบนถนน เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 17,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีภาพถ่ายสภาพแวดล้อมประกอบการรายงานผล ก่อน-หลังการแก้ไข (เฉพาะงานในหน้าที่ตำรวจ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 18,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การประสานงานกับหน่วยงานที่เกี่ยวข้องกับสภาพถนนไม่ปลอดภัยที่เป็นสาเหตุให้เกิดอุบัติเหตุ ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 19,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.3 ปัจจัยสาเหตุด้านสภาพรถ (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การตรวจยึด เพื่อให้เจ้าของรถไปดำเนินการแก้ไขปรับปรุงรถไม่ปลอดภัยบนถนนและที่อื่นๆ ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 20,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.3 ปัจจัยสาเหตุด้านสภาพรถ (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูลการจับคู่ประเภทของรถที่เกิดอุบัติเหตุ คู่กรณี เช่น รถยนต์+จักรยานยนต์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 21,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.4 การนำเทคโนโลยีมาใช้ในการแก้ไขและป้องกัน อบถ. และการนำอุปกรณ์ เครื่องมือมที่ ตร. จัดสรรให้มาใช้ (3 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "ให้สุ่มตรวจความพร้อมของอุปกรณ์ สภาพพร้อมใช้งาน ถูกต้องตามระเบียบ โดยให้มีภาพถ่ายการใช้เทคโนโลยีประกอบการรายงานผลตรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          - ระบบกล้องกวดขันวินัยจราจร เช่น กล้องตรวจจับผู้ฝ่าฝืนสัญญาณไฟจราจร กล้องตรวจจับความเร็ว กล้องตรวจับและเปรียบเทียบแผ่นป้ายทะเบียน กล้องตรวจจับการฝ่าฝืนการเปลี่ยนช่องทางในเขตห้าม"),
      formText(
          "          - ป้ายไฟฟ้าบอกสภาพการจราจรติดตั้งบนทางหรือติดตั้งบนยานพาหนะปฏิบัติการจราจรหรือป้ายจราจรอัจฉริยะ (มีอุบัติเหตุ ถนนชำรุด มีการก่อสร้าง)"),
      formText("          - กล้องติดหมวกผู้ปฏิบัติงานจราจร"),
      formText("          - กล้อง CCTV เพื่อใช้ประโยชน์ในงานจราจร"),
      formText(
          "          - มีกลุ่ม Line เพื่อบริหารจัดการ หรือรับแจ้ง-ส่ง ข่าวจราจร ตรวจสอบว่านำมาใช้งานได้จริง"),
      formText(
          "          - เครื่องตรวจวัดแอลกอฮอล์ จากลมหายใจแบบเบื้องต้นหรือแบบยืนยันผล"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  อย่างละ 1 คะแนน/ 3 อย่างขึ้นไป 3 คะแนน/ ถ้าไม่มีตามสภาพพื้นที่ของสถานี 1 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
  Form_(
    id: 22,
    header: h2(
        "1.4 การเปรียบเทียบผลการปฏิบัติในการแก้ไข ป้องกัน อบถ. และลดสถิติคนตายจาก อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("เปรียบเทียบสถิติคนตายจาก อบถ. ในรอบเดือน/ปีทีผ่านมา (ปีงบประมาณ 66-67) (5 คะแนน)"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  มีข้อมูลสถิติ/มีการเปรียบเทียบ/ครบถ้วน/ถูกต้อง/เป็นปัจจุบัน ให้คะแนนอย่างละ 1 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 5,
        txt: "5 คะแนน",
      ),
      Score_choice(
        score: 4,
        txt: "4 คะแนน",
      ),
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
  Form_(
    id: 23,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.1 ตรวจสอบหลักฐานคำสั่งการปฏิบัติหน้าที่ของเจ้าหน้าที่ตำรวจจราจร ประจำเดือน (2.5 คะแนน)"),
      formText(
          "เช่น การประจำจุด การกำหนดวงรอบของการปฏิบัติหน้าที่ การจัดร้อยเวร 60, ตารางเวร 60 หรือสายตรวจจราจรเพื่ออำนวยความสะดวกและจัดการจราจรกรณีเกิดเหตุจำเป็นเร่งด่วน"),
      formText(
          "          - สุ่มสอบถามจากผู้ปฏิบัติงานว่าเป็นไปตามคำสั่งหรือไม่"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มีคำสั่งและครอบคลุมภารกิจถูกต้องสมบูรณ์ (2.5 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "มีคำสั่งแต่ไม่สมบูรณ์ ไม่ครอบคลุมภารกิจ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่งให้ตรวจ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 24,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          ความถูกต้องสมบูรณ์ของการบันทึก (1.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1.5,
        txt: "ถูกต้องสมบูรณ์ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "บันทึกไม่ถูกต้องหรือไม่สมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 25,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ความเหมาะสมของช่วงเวลาในการอบรมปล่อยแถว เช่น ผลัดเข้า เวลา 15.00 น. หรือ 05.30 ฯ. และผลัดบ่าย เวลา 14.00 น. หรือ 15.00 น. เป็นต้น หรือตามความเหมาะสมกับพื้นที่ (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "เหมาะสม (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่เหมาะสม หรือไม่ลงเวลา (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 26,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การตรวจสอบความพร้อมในการปฏิบัติหน้าที่ การแต่งเครื่องแบบ และทรงผม อาวุธประจำกาย ยานพาหนะ เครื่องมือสื่อสาร เครื่องพันธนาการ ใบสั่งเจ้าพนักงานจราจร เป็นต้น (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีบันทึก (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "บันทึกไม่ชัดเจน หรือไม่มีการบันทึก (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 27,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูล หลักฐาน ว่ามีการซ้อมหรือร่วมซักซ้อมแผนเผชิญเหตุครบถ้วน เดือนละ 1 ครั้ง (ตรวจในรอบปีงบประมาณที่ได้รับการตรวจ) (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "มีหลักฐานการซักซ้อมแผนฯ ครบทุกเดือน (3 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีหลักฐานการซักซ้อมแผนฯ แต่ไม่ครบ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีการซ้อมหรือไม่มีหลักฐาน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 28,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          สอบถามเจ้าหน้าที่ผู้ปฏิบัติงานจราจร จำนวน 2 ราย ว่าทราบหน้าที่ของตนเองเวลาเกิดเหตุหรือไม่ และในแผนจะต้องปฏิบัติอย่างไร (4 คะแนน) หมายเหตุ รายละ 2 คะแนน"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  สอบถามแล้วทราบหน้าที่ของตนเองได้อย่างถูกต้อง ให้ 2 คะแนน/ ทราบแต่ไม่ถูกต้องทั้งหมด ให้ 1 คะแนน/ ไม่ทราบ ตอบไม่ได้ ให้ 0 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 4,
        txt: "4 คะแนน",
      ),
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
  Form_(
    id: 29,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          สอบถามหัวหน้างานจราจร สามารถอธิบายรายละเอียดการปฏิบัติของงานจราจรเมื่อเกิดเหตุ (ผู้ตรวจยกตัวอย่าง 1 เหตุ) (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "สามารถอธิบายได้ชัดเจน เข้าใจได้ (3 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "อธิบายพอใช้ได้ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "อธิบายไม่ได้ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 30,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีคำสั่งตั้งจุดตรวจถูกต้องตามระเบียบฯ มีนายตำรวจชั้นสัญญาบัตรควบคุม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 31,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีป้าย และอุปกรณ์ ที่จำเป็นในการตั้งจุดตรวจถูกต้อง ครบถ้วน (CCTV และ Police Body Camera) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 32,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          สถานที่เหมาะสมไม่เป็นจุดเสี่ยงที่อาจเกิดอันตรายมีข้อมูลสถิติอุบัติเหตุหรือไม่ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 33,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ในพื้นที่รับผิดชอบติดต่อกัน มีการตั้งจุดตรวจไม่ซ้ำซ้อนกัน จนทำให้เกิดปัญหาจราจรหรือสร้างความเดือดร้อนให้ประชาชน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 34,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีประชุมชี้แจง ซักซ้อมการปฏิบัติ และตรวจสอบความพร้อมในการปฏิบัติหน้าที่เกี่ยวกับงานจราจร ให้แก่เจ้าหน้าที่จราจร เจ้าหน้าที่จากหน่วยงานอื่น หรืออาสาสมัครให้เข้าใจอำนาจหน้าที่ การใช้กิริยาวาจา และการแต่งกายจะต้องมีสัญลักษณ์หรือเครื่องหมายบอกฝ่ายที่ไม่ทำให้ประชาชนเกิดความสับสน เช่น คำพูดมาตรฐาน การใช้กริยา วาจา สุภาพ และเหมาะสม ในการตั้งจุดตรวจ ความรู้กฎหมายใหม่, กฎหมายที่ควรรู้, การสร้างจิตสำนึกสามารถตอบข้อซักถามหรือให้คำแนะนำกับประชาชนได้ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 35,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีแผนงาน/โครงการ/แผน การอบรมให้ความรู้เกี่ยวกับงานจราจร เช่น ความรู้, กฎหมายใหม่, กฎหมายที่ควรรู้หรือการจัดการจราจร และซักซ้อมการปฏิบัติให้เป็นไปตามหลักยุทธวิธีตำรวจ ด้านการบังคับใช้กฎหมายในสถานการณ์จริงในการปฏิบัติหน้าที่การใช้อุปกรณ์หรือเครื่องมือหรือชุดทดสอบในการตรวจวัดระดับแอลกอฮอล์ หรือการตรวจสารเสพติด ตรวจสอบอุปกรณ์ประจำกายและประจำจุดตรวจการ กำชับมิให้มีพฤติการณ์ไม่เหมาะสมหรือส่อไปในทางทุจริตหรือแสวงหาผลประโยชน์โดยมิชอบการฝึกปฏิบัติ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 36,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีสมุดบันทึกการอบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 37,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีภาพถ่ายในระหว่างการฝึกอบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 38,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ให้นำองค์ความรู้ต่างๆ ที่เป็นปัจจุบัน มารวบรวมไว้เป็นคู่มือแก่ผู้ปฏิบัติหน้าที่จราจร ศึกษา ทบทวน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 39,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการสุ่มทดสอบความรู้ ความเข้าใจของเจ้าหน้าที่ตำรวจจราจร (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 40,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการเก็บรวบรวมสถิติผลการจับกุมไว้ทุกเดือน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 41,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีการรวบรวมสถิติแยกตามประเภทตามฐานความผิด (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 42,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการเปรียบเทียบสถิติผลการจับกุมรายเดือนปีปัจจุบัน (รอบปีงบประมาณ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 43,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          เก็บรวบรวมสถิติฐานความผิด ไม่จัดทำประกันภัยภาคบังคับ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 44,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.1 การออกใบสั่งจราจรแบบส่งทางไปรษณีย์ที่ตรวจพบการกระทำผิดจากเครื่องอุปกรณ์ทางอิเล็กทรอนิกส์ที่เป็นครุภัณฑ์ของทางราชการและได้รับอนุญาตถูกต้อง (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการออกใบสั่งจากระบบ PTM และมีข้อมูลครบถ้วน ตามหลักเกณฑ์ที่ ตร. กำหนด (สุ่มเปรียบเทียบเลขที่ใบสั่งกับฐานข้อมูล ว่าตรงกันหรือไม่) (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มี (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 45,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.1 การออกใบสั่งจราจรแบบส่งทางไปรษณีย์ที่ตรวจพบการกระทำผิดจากเครื่องอุปกรณ์ทางอิเล็กทรอนิกส์ที่เป็นครุภัณฑ์ของทางราชการและได้รับอนุญาตถูกต้อง (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีกล้องตรวจจับความเร็ว จะต้องมีแผนการออกตรวจอย่างน้อย เดือนละ 1 ครั้ง (2.5 คะแนน)"),
    ],
    widgets_2: [
      formRow("หมายเหตุ",
          " กรณีไม่ได้รับการจัดสรรกล้องตรวจจับความเร็ว ให้ 2.5 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มี (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 46,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.2 ตรวจสอบหลักฐานมีการนำเข้าข้อมูลใบสั่งจราจร และใบรับแทนใบอนุญาตขับขี่ (ใบสั่งจราจรแบบเล่ม) เข้าสู่ระบบ PTM (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การบันทึกข้อมูลใบสั่งลงในระบบ PTM ครบถ้วนตามที่ ตร. กำหนด (ตรวจสอบผ่านหน้าจอระบบ PTM ครบถ้วน เป็นปัจจุบัน ใบสั่ง มีการลงระบบภายใน 2 วัน) (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "เกณฑ์การให้คะแนน สมบูรณ์ (2.5 คะแนน)",
      ),
      Score_choice(
        score: 1.25,
        txt: "ไม่สมบูรณ์ (1.25 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่ได้บันทึก หรือไม่บันทึกภายใน 2 วัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 47,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.2 ตรวจสอบหลักฐานมีการนำเข้าข้อมูลใบสั่งจราจร และใบรับแทนใบอนุญาตขับขี่ (ใบสั่งจราจรแบบเล่ม) เข้าสู่ระบบ PTM (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การออกหนังสือแจ้งผู้ไม่ปฏิบัติตามใบสั่ง (หนังสือเตือน) ให้ดำเนินการผ่านระบบ PTM ภายในระยะเวลาที่กฎหมายกำหนด และออกหนังสือโดยข้าราชการตำรวจตำแหน่งตั้งแต่สารวัตรขึ้นไปเท่านั้น (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มีการส่งหนังสือเตือนจากระบบทุกรายจริง (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ส่งแต่ไม่ครบทุกราย (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 48,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.3 ตรวจสอบการดำเนินการออกใบสั่งทุกประเภท ผ่านระบบ PTM เท่านั้น ทั้งใบสั่ง แบบที่ 1 (ใบสั่งเล่ม) แบบที่ 2 (ใบสั่งกล้อง) และแบบที่ 3 (ใบสั่งอิเล็กทรอนิกส์) (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          เกณฑ์การตรวจ สุ่มตรวจระบบใบสั่งว่าเป็นไปตามประกาศ ตร. เรื่องกำหนดแบบใบสั่งเจ้าพนักงานจราจร (ฉบับบที่ 2) พ.ศ.2564 ลง 24 มิ.ย. 2564 หรือไม่"),
    ],
    widgets_2: [
      formRow("หมายเหตุ",
          " ใบสั่งแบบออกโดยโรงพิมพ์ ตร. เท่านั้น หากมีการใช้ใบสั่งที่จัดพิมพ์จากที่อื่น ให้ 0 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีการลงใบสั่งทุกแบบเข้าระบบ PTM ครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "ลงเข้าระบบไม่ครบแต่มีเหตุผล (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีการลงใบสั่งเข้าระบบ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 49,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการจัดทำโครงการ กิจกรรม การอบรมเผยแพร่ความรู้ฯ ให้กับสถานศึกษา หน่วยงานต่างๆ อย่างน้อยเดือนละ 1 ครั้ง (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 50,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการกำหนดกลุ่มเป้าหมาย วัตถุประสงค์ และประโยชน์ที่คาดว่าจะได้รับอย่างชัดเจน (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 51,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีคำสั่งมอบหมายให้มีผู้รับผิดชอบดำเนินการจัดทำโครงการ กิจกรรม อบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 52,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีหลักฐานการจัดโครงการ กิจกรรมตามแผน เช่น มีการบันทึกภาพนิ่ง ภาพเคลื่อนไหว (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 53,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการจัดทำปฏิทินโครงการ กิจกรรม รายปี (หากมีปฏิทินเป็นช่วงไม่ครบทั้งปี ตัดคะแนน) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 54,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการรวบรวมสถิติผู้เข้ารับการอบรม เช่น เอกสารลงทะเบียนรายชื่อ เบอร์โทรศัพท์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 55,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีแฟ้มรวบรวมสภาพปัญหาที่ประชาชนแจ้ง เช่น คำร้อง บันทึกทางวิทยุ line ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 56,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการขอรับการสนับสนุนงบประมาณจากแหล่งทุนอื่น เช่น สสส. กปถ. บ.กลางคุัมครอง ผู้ประสบภัยจากรถ สถาบันการศึกษา มูลนิธิองค์กรภาคเอกชนต่างๆ ตลอดจนหน่วยงานอื่นๆ ของรัฐ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 57,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          จัดทำปฏิทินการทำงานโครงการ/กิจกรรม รายปี ไว้อย่างชัดเจน (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 58,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          ตรวจโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้ ความเข้าใจกฎหมาย ระเบียบวินัยเกี่ยวกับงานจราจรว่าผู้เข้าร่วมโครงการ/กิจกรรม ให้ตรงกับกลุ่มเป้าหมาย (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "มีข้อมูลครบถ้วน (3 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 59,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          มีคำสั่งมอบหมายให้มีผู้รับผิดชอบดำเนินการจัดทำโครงการ กิจกรรม อบรม (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 60,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          มีหลักฐานการจัดโครงการ กิจกรรมตามแผน เช่น มีสรุปผล การบันทึกภาพนิ่ง ภาพเคลื่อนไหว (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 61,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText("          มีการสรุปผล ติดตามประเมินผลโครงการอบรม (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 62,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          รวบรวมข้อมูลรายชื่อและหมายเลขโทรศัพท์ผู้ผ่านการอบรม และผู้ช่วยเหลืองานจราจร (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 63,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          มีการประชาสัมพันธ์ แนะนำให้นำมาตรการองค์กรทั้งภาครัฐและเอกชน สถานประกอบการมาใช้ (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 64,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูลเกี่ยวกับปัญหาการจราจร เช่น ระยะเวลาการก่อสร้างรถไฟฟ้า การวางระบบน้ำปะปา เป็นต้น (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 65,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีภาพถ่ายกิจกรรมการประชาสัมพันธ์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและเป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 66,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการประสานงานกับหน่วยพื้นที่ที่เกี่ยวข้อง (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 67,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีช่องทางของสื่อในการประชาสัมพันธ์ (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 68,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีการประชาสัมพันธ์โครงการอาสาตาจราจร (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและเป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 69,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.2 รวบรวมปัญหาข้อร้องเรียน/ ข้อเสนอแนะ/ วิธีการแก้ไขจากสื่อต่างๆ จากประชาชน ชุมชน หน่วยงานที่เกี่ยวข้องไว้ทุกเดือน (1.5 คะแนน)"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          " มีข้อมูลเรื่องที่ร้องเรียน และการป้องกัน/แก้ไข เรื่องที่ร้องเรียนอย่างไรบ้าง")
    ],
    choice: [
      Score_choice(
        score: 1.5,
        txt: "มีข้อมูลและสมบูรณ์ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่สมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
];

List<Form_> form_1 = [
  Form_(
    id: 1,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.1 คำสั่งหัวหน้าสถานีตำรวจ เรื่อง การจัดตำรวจร้อยเวร 20/จราจรร่วมพนักงานสอบสวนตรวจที่เกิดเหตุ อบถ. (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "คำสั่งมีความครบถ้วน สมบูรณ์ เป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีคำสั่ง ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่ง (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 2,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.2 รายงานการสืบสวน อบถ. (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          ตรวจสอบการกรอกข้อมูลในแบบสอบสวน อบถ.ตร. กำหนด"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "สุ่มตรวจการกรอกข้อมูลในแบบ อบถ. กรอกครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีการกรอกข้อมูล ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่กรอก/ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 3,
    header: h2(
        "1.1 การไปที่เกิดเหตุ อบถ. และจัดการจราจร ณ ที่เกิดเหตุให้ปลอดภัยและกลับคืนสู่สภาพการจราจรและสืบสวนหาสาเหตุ อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("1.1.3 ภาพถ่ายสถานที่เกิดเหตุ และภาพถ่ายปัจจัยสาเหตุ อบถ. (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt:
            "มีภาพถ่ายที่เกิดเหตุครบองค์ประกอบ (คน,ถนน/ส่วนควบ,ยานพาหนะ) (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีภาพถ่าย ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี/ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 4,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText("          มีคำสั่งแต่งตั้งคณะทำงาน อบถ.สน./สภ. (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีคำสั่งและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.25,
        txt: "มีคำสั่งแต่ไม่เป็นปัจจุบัน (0.25 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่ง (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 5,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานการประชุม อบถ. สน./สภ. อย่างน้อย 1 ครั้ง/เดือน โดยมีมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย ในรายงานการประชุม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วนทุกเดือน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 6,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานการประชุม อบถ. ภายนอกหน่วย ร่วมกับภาคีเครือข่ายที่เกี่ยวข้องในพื้นที่ สน./สภ. ประจำเดือนหรือช่วงเวลาที่เหมาะสม ตามโครงสร้างของคณะอนุกรรมการบังคับใช้กฎหมายของ ปภ. จังหวัด (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วนทุกเดือน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 7,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText("          ภาพถ่ายการจัดประชุม อบถ. (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีภาพถ่าย (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีภาพถ่าย (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 8,
    header: h2(
        "1.2 การวิเคราะห์สาเหตุจากระบบข้อมูล อบถ.ตร. เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกัน อบถ. เพื่อลดจำนวนคนบาดเจ็บ/ตาย (4 คะแนน)",
        ""),
    widgets_1: [
      h3("การนำผลการประมวลจากระบบข้อมูล อบถ.ตร. ไปประชุมวิเคราะห์สาเหตุการเกิดอุบัติเหตุ เพื่อวางแผนและกำหนดมาตรการแก้ไขและป้องกันเกิดอุบัติเหตุ"),
      SizedBox(height: boxPadding),
      formText(
          "          สัมภาษณ์เจ้าหน้าที่ผู้ปฏิบัติงาน ว่ามีการประชุม และทราบการวิเคราะห์ปัญหาสาเหตุและมีมาตรการหรือไม่ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีมาตรการและทราบครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "ทราบไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่ทราบ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 9,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          คำสั่งตั้งด่านหรือกวดขันจับกุมพร้อมระบุเหตุผลซึ่งเป็นมติจากที่ประชุม อบถ. (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 10,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          สถิติการจับกุมข้อหาต่างๆ และการไม่จัดทำ พ.ร.บ.คุ้มครองฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 11,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รณรงค์ ประชาสัมพันธ์ ขอความร่วมมือ หน่วยงาน องค์กร ทั้งภาครัฐและเอกชน สถานประกอบการและชุมชน ให้ใช้มาตรการองค์กร เกี่ยวกับมาตรการที่ช่วยให้เกิดความปลอดภัยในการขับรถ เช่น เมาไม่ขับ ขับไม่โทร การสวมหมวกนิรภัย/การคาดเข็มขัดนิรภัย เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 12,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การร่วมมือกับหน่วยงานต่างๆ ในการออกมาตรการแก้ไขและป้องกันร่วมกัน เช่น บริษัท/สถานศึกษา/โรงงาน/หน่วยงานราชการ ออกระเบียบให้ใส่หมวกนิรภัย เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 13,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.1 ปัจจัยสาเหตุด้านสภาพและพฤติกรรมของผู้ขับขี่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          คำสั่งมาตรการการแข่งรถในทาง (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มี (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี ไม่ปฏิบัติ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 14,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานผลสำรวจจุดเสี่ยง ระบุประเภทของถนน หมายเลขถนน ชัดเจน พร้อมการวิเคราะห์เหตุผลความเสี่ยงประกอบรายงาน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 15,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีภาพถ่ายสภาพถนนและส่วนควบ เช่น ข้อมูลด้านวิศวกรรมจราจร ไฟ เครื่องหมาย ประกอบการรายงานผล (ก่อน-หลังการแก้ไขเฉพาะงานในหน้าที่ตำรวจ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 16,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          รายงานผลการสำรวจสภาพแวดล้อมที่เสี่ยงอันตราย อันเป็นปัจจัยทำให้เกิดอุบัติเหตุ เช่น มีฝูงวัวควายข้ามถนน ไม่มีไฟส่องสว่างบนถนน เป็นต้น (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 17,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีภาพถ่ายสภาพแวดล้อมประกอบการรายงานผล ก่อน-หลังการแก้ไข (เฉพาะงานในหน้าที่ตำรวจ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 18,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.2 ปัจจัยสาเหตุด้านสภาพถนนและส่วนควบคุมของถนน (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การประสานงานกับหน่วยงานที่เกี่ยวข้องกับสภาพถนนไม่ปลอดภัยที่เป็นสาเหตุให้เกิดอุบัติเหตุ ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 19,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.3 ปัจจัยสาเหตุด้านสภาพรถ (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การตรวจยึด เพื่อให้เจ้าของรถไปดำเนินการแก้ไขปรับปรุงรถไม่ปลอดภัยบนถนนและที่อื่นๆ ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 20,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.3 ปัจจัยสาเหตุด้านสภาพรถ (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูลการจับคู่ประเภทของรถที่เกิดอุบัติเหตุ คู่กรณี เช่น รถยนต์+จักรยานยนต์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 21,
    header: h2(
        "1.3 การปฏิบัติในการแก้ไขและป้องกัน อบถ. ในแต่ละปัจจัยสาเหตุ และการนำเทคโนโลยีมาใช้งาน (15 คะแนน)",
        ""),
    widgets_1: [
      h3("1.3.4 การนำเทคโนโลยีมาใช้ในการแก้ไขและป้องกัน อบถ. และการนำอุปกรณ์ เครื่องมือมที่ ตร. จัดสรรให้มาใช้ (3 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "ให้สุ่มตรวจความพร้อมของอุปกรณ์ สภาพพร้อมใช้งาน ถูกต้องตามระเบียบ โดยให้มีภาพถ่ายการใช้เทคโนโลยีประกอบการรายงานผลตรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          - ระบบกล้องกวดขันวินัยจราจร เช่น กล้องตรวจจับผู้ฝ่าฝืนสัญญาณไฟจราจร กล้องตรวจจับความเร็ว กล้องตรวจับและเปรียบเทียบแผ่นป้ายทะเบียน กล้องตรวจจับการฝ่าฝืนการเปลี่ยนช่องทางในเขตห้าม"),
      formText(
          "          - ป้ายไฟฟ้าบอกสภาพการจราจรติดตั้งบนทางหรือติดตั้งบนยานพาหนะปฏิบัติการจราจรหรือป้ายจราจรอัจฉริยะ (มีอุบัติเหตุ ถนนชำรุด มีการก่อสร้าง)"),
      formText("          - กล้องติดหมวกผู้ปฏิบัติงานจราจร"),
      formText("          - กล้อง CCTV เพื่อใช้ประโยชน์ในงานจราจร"),
      formText(
          "          - มีกลุ่ม Line เพื่อบริหารจัดการ หรือรับแจ้ง-ส่ง ข่าวจราจร ตรวจสอบว่านำมาใช้งานได้จริง"),
      formText(
          "          - เครื่องตรวจวัดแอลกอฮอล์ จากลมหายใจแบบเบื้องต้นหรือแบบยืนยันผล"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  อย่างละ 1 คะแนน/ 3 อย่างขึ้นไป 3 คะแนน/ ถ้าไม่มีตามสภาพพื้นที่ของสถานี 1 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
  Form_(
    id: 22,
    header: h2(
        "1.4 การเปรียบเทียบผลการปฏิบัติในการแก้ไข ป้องกัน อบถ. และลดสถิติคนตายจาก อบถ. (5 คะแนน)",
        ""),
    widgets_1: [
      h3("เปรียบเทียบสถิติคนตายจาก อบถ. ในรอบเดือน/ปีทีผ่านมา (ปีงบประมาณ 66-67) (5 คะแนน)"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  มีข้อมูลสถิติ/มีการเปรียบเทียบ/ครบถ้วน/ถูกต้อง/เป็นปัจจุบัน ให้คะแนนอย่างละ 1 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 5,
        txt: "5 คะแนน",
      ),
      Score_choice(
        score: 4,
        txt: "4 คะแนน",
      ),
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
];
List<Form_> form_2 = [
  Form_(
    id: 23,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.1 ตรวจสอบหลักฐานคำสั่งการปฏิบัติหน้าที่ของเจ้าหน้าที่ตำรวจจราจร ประจำเดือน (2.5 คะแนน)"),
      formText(
          "เช่น การประจำจุด การกำหนดวงรอบของการปฏิบัติหน้าที่ การจัดร้อยเวร 60, ตารางเวร 60 หรือสายตรวจจราจรเพื่ออำนวยความสะดวกและจัดการจราจรกรณีเกิดเหตุจำเป็นเร่งด่วน"),
      formText(
          "          - สุ่มสอบถามจากผู้ปฏิบัติงานว่าเป็นไปตามคำสั่งหรือไม่"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มีคำสั่งและครอบคลุมภารกิจถูกต้องสมบูรณ์ (2.5 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "มีคำสั่งแต่ไม่สมบูรณ์ ไม่ครอบคลุมภารกิจ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีคำสั่งให้ตรวจ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 24,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          ความถูกต้องสมบูรณ์ของการบันทึก (1.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1.5,
        txt: "ถูกต้องสมบูรณ์ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "บันทึกไม่ถูกต้องหรือไม่สมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 25,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ความเหมาะสมของช่วงเวลาในการอบรมปล่อยแถว เช่น ผลัดเข้า เวลา 15.00 น. หรือ 05.30 ฯ. และผลัดบ่าย เวลา 14.00 น. หรือ 15.00 น. เป็นต้น หรือตามความเหมาะสมกับพื้นที่ (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "เหมาะสม (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่เหมาะสม หรือไม่ลงเวลา (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 26,
    header: h2(
        "2.1 การอบรมปล่อยแถวเจ้าหน้าที่ตำรวจจราจรก่อนออกปฏิบัติหน้าที่ตามหนังสือ ตร. ที่ 0601(ปป.)/384 ลง 9 ก.ค. 2540 เรื่องให้กวดขันเกี่ยวกับความประพฤติและระเบียบวินัยของข้าราชการตำรวจ รวมทั้งกวดขันการแต่งเครื่องแบบและทรงผมให้ถือปฏิบัติตามระเบียบและเกณฑ์ที่ ตร. กำหนด (5 คะแนน)",
        ""),
    widgets_1: [
      h3("2.1.2 ตรวจสอบหลักฐานการกวดขันความประพฤติและระเบียบวินัยจากสมุดบันทึกการอบรมปล่อยแถวจราจรทุกผลัด เช่น ผลัดเช้าและผลัดบ่าย ของ หัวหน้า สน./สภ. หรือรอง ผกก.จร. หรือ สว.จร. หรือ หน.งาน จร. (สมุดเล่มเดียวบันทึกด้วยตนเอง) (2.5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การตรวจสอบความพร้อมในการปฏิบัติหน้าที่ การแต่งเครื่องแบบ และทรงผม อาวุธประจำกาย ยานพาหนะ เครื่องมือสื่อสาร เครื่องพันธนาการ ใบสั่งเจ้าพนักงานจราจร เป็นต้น (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีบันทึก (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "บันทึกไม่ชัดเจน หรือไม่มีการบันทึก (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 27,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูล หลักฐาน ว่ามีการซ้อมหรือร่วมซักซ้อมแผนเผชิญเหตุครบถ้วน เดือนละ 1 ครั้ง (ตรวจในรอบปีงบประมาณที่ได้รับการตรวจ) (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "มีหลักฐานการซักซ้อมแผนฯ ครบทุกเดือน (3 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีหลักฐานการซักซ้อมแผนฯ แต่ไม่ครบ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีการซ้อมหรือไม่มีหลักฐาน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 28,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          สอบถามเจ้าหน้าที่ผู้ปฏิบัติงานจราจร จำนวน 2 ราย ว่าทราบหน้าที่ของตนเองเวลาเกิดเหตุหรือไม่ และในแผนจะต้องปฏิบัติอย่างไร (4 คะแนน) หมายเหตุ รายละ 2 คะแนน"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          "  สอบถามแล้วทราบหน้าที่ของตนเองได้อย่างถูกต้อง ให้ 2 คะแนน/ ทราบแต่ไม่ถูกต้องทั้งหมด ให้ 1 คะแนน/ ไม่ทราบ ตอบไม่ได้ ให้ 0 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 4,
        txt: "4 คะแนน",
      ),
      Score_choice(
        score: 3,
        txt: "3 คะแนน",
      ),
      Score_choice(
        score: 2,
        txt: "2 คะแนน",
      ),
      Score_choice(
        score: 1,
        txt: "1 คะแนน",
      ),
      Score_choice(
        score: 0.0,
        txt: "0 คะแนน",
      ),
    ],
  ),
  Form_(
    id: 29,
    header: h2(
        "2.2 ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ เดือนละ 1 ครั้ง ตามความเหมาะสม (10 คะแนน)",
        ""),
    widgets_1: [
      h3("ร่วมซักซ้อมแผนเผชิญเหตุของสถานีตำรวจ"),
      SizedBox(height: boxPadding),
      formText(
          "          สอบถามหัวหน้างานจราจร สามารถอธิบายรายละเอียดการปฏิบัติของงานจราจรเมื่อเกิดเหตุ (ผู้ตรวจยกตัวอย่าง 1 เหตุ) (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "สามารถอธิบายได้ชัดเจน เข้าใจได้ (3 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "อธิบายพอใช้ได้ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "อธิบายไม่ได้ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 30,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีคำสั่งตั้งจุดตรวจถูกต้องตามระเบียบฯ มีนายตำรวจชั้นสัญญาบัตรควบคุม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 31,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีป้าย และอุปกรณ์ ที่จำเป็นในการตั้งจุดตรวจถูกต้อง ครบถ้วน (CCTV และ Police Body Camera) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 32,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          สถานที่เหมาะสมไม่เป็นจุดเสี่ยงที่อาจเกิดอันตรายมีข้อมูลสถิติอุบัติเหตุหรือไม่ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 33,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ในพื้นที่รับผิดชอบติดต่อกัน มีการตั้งจุดตรวจไม่ซ้ำซ้อนกัน จนทำให้เกิดปัญหาจราจรหรือสร้างความเดือดร้อนให้ประชาชน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 34,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.1 ตรวจสอบแผนการตั้งจุดตรวจ โดยออกคำสั่งฯ และปฏิบัติถูกต้องเป็นไปตามเกณฑ์ที่ ตร. กำหนดไว้หรือไม่ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีประชุมชี้แจง ซักซ้อมการปฏิบัติ และตรวจสอบความพร้อมในการปฏิบัติหน้าที่เกี่ยวกับงานจราจร ให้แก่เจ้าหน้าที่จราจร เจ้าหน้าที่จากหน่วยงานอื่น หรืออาสาสมัครให้เข้าใจอำนาจหน้าที่ การใช้กิริยาวาจา และการแต่งกายจะต้องมีสัญลักษณ์หรือเครื่องหมายบอกฝ่ายที่ไม่ทำให้ประชาชนเกิดความสับสน เช่น คำพูดมาตรฐาน การใช้กริยา วาจา สุภาพ และเหมาะสม ในการตั้งจุดตรวจ ความรู้กฎหมายใหม่, กฎหมายที่ควรรู้, การสร้างจิตสำนึกสามารถตอบข้อซักถามหรือให้คำแนะนำกับประชาชนได้ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 35,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีแผนงาน/โครงการ/แผน การอบรมให้ความรู้เกี่ยวกับงานจราจร เช่น ความรู้, กฎหมายใหม่, กฎหมายที่ควรรู้หรือการจัดการจราจร และซักซ้อมการปฏิบัติให้เป็นไปตามหลักยุทธวิธีตำรวจ ด้านการบังคับใช้กฎหมายในสถานการณ์จริงในการปฏิบัติหน้าที่การใช้อุปกรณ์หรือเครื่องมือหรือชุดทดสอบในการตรวจวัดระดับแอลกอฮอล์ หรือการตรวจสารเสพติด ตรวจสอบอุปกรณ์ประจำกายและประจำจุดตรวจการ กำชับมิให้มีพฤติการณ์ไม่เหมาะสมหรือส่อไปในทางทุจริตหรือแสวงหาผลประโยชน์โดยมิชอบการฝึกปฏิบัติ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 36,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีสมุดบันทึกการอบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 37,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีภาพถ่ายในระหว่างการฝึกอบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 38,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          ให้นำองค์ความรู้ต่างๆ ที่เป็นปัจจุบัน มารวบรวมไว้เป็นคู่มือแก่ผู้ปฏิบัติหน้าที่จราจร ศึกษา ทบทวน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 39,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.2 ตรวจสอบการจัดฝึกอบรมหรือทบทวนความรู้ด้านกฎหมายที่เป็นปัจจุบัน การบริหารจัดการจราจรตามแผนเผชิญเหตุ ให้กับเจ้าหน้าที่จราจร อย่างสม่ำเสมอ (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการสุ่มทดสอบความรู้ ความเข้าใจของเจ้าหน้าที่ตำรวจจราจร (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีโดยสมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่สมบูรณ์ (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 40,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการเก็บรวบรวมสถิติผลการจับกุมไว้ทุกเดือน (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 41,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("          มีการรวบรวมสถิติแยกตามประเภทตามฐานความผิด (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 42,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการเปรียบเทียบสถิติผลการจับกุมรายเดือนปีปัจจุบัน (รอบปีงบประมาณ) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 43,
    header: h2(
        "2.3 การตั้งจุดตรวจเพื่อบังคับใช้กฎหมายกับประชาชนอย่างเหมาะสม และถูกต้องเป็นไปตามระเบียบฯ ตามหนังสือ ตร. ที่ 0007.34/5578 ลง 13 ธ.ค.56, หนังสือ ตร. ที่ 0007.22/1572 ลง 31 พ.ค.64, หนังสือ ตร. ที่ 0007.34/681 ลง 3 มี.ค.64 มาตราการปฏิบัติเกี่ยวกับการตั้งจุดตรวจ จุดบังคับใช้กฎหมาย และหนังสือ ตร. ด่วนที่สุด ที่ 0007.22/438 ลง 2 ก.พ.66 เรื่องกำชับการปฏิบัติเกี่ยวกับการตั้งด่านตรวจ จุดตรวจและจุดสกัด (14 คะแนน) (ระบบ TPCC)",
        ""),
    widgets_1: [
      h3("2.3.3 ตรวจสอบการรวบรวมสถิติผลการจับกุมคดีจราจร 10 ฐานความผิด และฐานความผิดไม่จัดทำประกันภัยภาคบังคับ (พ.ร.บ.คุ้มครองฯ) (4 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          เก็บรวบรวมสถิติฐานความผิด ไม่จัดทำประกันภัยภาคบังคับ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 44,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.1 การออกใบสั่งจราจรแบบส่งทางไปรษณีย์ที่ตรวจพบการกระทำผิดจากเครื่องอุปกรณ์ทางอิเล็กทรอนิกส์ที่เป็นครุภัณฑ์ของทางราชการและได้รับอนุญาตถูกต้อง (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการออกใบสั่งจากระบบ PTM และมีข้อมูลครบถ้วน ตามหลักเกณฑ์ที่ ตร. กำหนด (สุ่มเปรียบเทียบเลขที่ใบสั่งกับฐานข้อมูล ว่าตรงกันหรือไม่) (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มี (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 45,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.1 การออกใบสั่งจราจรแบบส่งทางไปรษณีย์ที่ตรวจพบการกระทำผิดจากเครื่องอุปกรณ์ทางอิเล็กทรอนิกส์ที่เป็นครุภัณฑ์ของทางราชการและได้รับอนุญาตถูกต้อง (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          มีกล้องตรวจจับความเร็ว จะต้องมีแผนการออกตรวจอย่างน้อย เดือนละ 1 ครั้ง (2.5 คะแนน)"),
    ],
    widgets_2: [
      formRow("หมายเหตุ",
          " กรณีไม่ได้รับการจัดสรรกล้องตรวจจับความเร็ว ให้ 2.5 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มี (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 46,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.2 ตรวจสอบหลักฐานมีการนำเข้าข้อมูลใบสั่งจราจร และใบรับแทนใบอนุญาตขับขี่ (ใบสั่งจราจรแบบเล่ม) เข้าสู่ระบบ PTM (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การบันทึกข้อมูลใบสั่งลงในระบบ PTM ครบถ้วนตามที่ ตร. กำหนด (ตรวจสอบผ่านหน้าจอระบบ PTM ครบถ้วน เป็นปัจจุบัน ใบสั่ง มีการลงระบบภายใน 2 วัน) (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "เกณฑ์การให้คะแนน สมบูรณ์ (2.5 คะแนน)",
      ),
      Score_choice(
        score: 1.25,
        txt: "ไม่สมบูรณ์ (1.25 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่ได้บันทึก หรือไม่บันทึกภายใน 2 วัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 47,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.2 ตรวจสอบหลักฐานมีการนำเข้าข้อมูลใบสั่งจราจร และใบรับแทนใบอนุญาตขับขี่ (ใบสั่งจราจรแบบเล่ม) เข้าสู่ระบบ PTM (5 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          การออกหนังสือแจ้งผู้ไม่ปฏิบัติตามใบสั่ง (หนังสือเตือน) ให้ดำเนินการผ่านระบบ PTM ภายในระยะเวลาที่กฎหมายกำหนด และออกหนังสือโดยข้าราชการตำรวจตำแหน่งตั้งแต่สารวัตรขึ้นไปเท่านั้น (2.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2.5,
        txt: "มีการส่งหนังสือเตือนจากระบบทุกรายจริง (2.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ส่งแต่ไม่ครบทุกราย (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 48,
    header: h2(
        "2.4 การจัดการเครื่องอุปกรณ์ตรวจจับผู้กระทำความผิดกฎหมายจราจร และการจัดทำระบบฐานข้อมูล (12 คะแนน)",
        ""),
    widgets_1: [
      h3("2.4.3 ตรวจสอบการดำเนินการออกใบสั่งทุกประเภท ผ่านระบบ PTM เท่านั้น ทั้งใบสั่ง แบบที่ 1 (ใบสั่งเล่ม) แบบที่ 2 (ใบสั่งกล้อง) และแบบที่ 3 (ใบสั่งอิเล็กทรอนิกส์) (2 คะแนน)"),
      SizedBox(height: boxPadding),
      formText(
          "          เกณฑ์การตรวจ สุ่มตรวจระบบใบสั่งว่าเป็นไปตามประกาศ ตร. เรื่องกำหนดแบบใบสั่งเจ้าพนักงานจราจร (ฉบับบที่ 2) พ.ศ.2564 ลง 24 มิ.ย. 2564 หรือไม่"),
    ],
    widgets_2: [
      formRow("หมายเหตุ",
          " ใบสั่งแบบออกโดยโรงพิมพ์ ตร. เท่านั้น หากมีการใช้ใบสั่งที่จัดพิมพ์จากที่อื่น ให้ 0 คะแนน")
    ],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีการลงใบสั่งทุกแบบเข้าระบบ PTM ครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "ลงเข้าระบบไม่ครบแต่มีเหตุผล (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีการลงใบสั่งเข้าระบบ (0 คะแนน)",
      ),
    ],
  ),
];
List<Form_> form_3 = [
  Form_(
    id: 49,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการจัดทำโครงการ กิจกรรม การอบรมเผยแพร่ความรู้ฯ ให้กับสถานศึกษา หน่วยงานต่างๆ อย่างน้อยเดือนละ 1 ครั้ง (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 50,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการกำหนดกลุ่มเป้าหมาย วัตถุประสงค์ และประโยชน์ที่คาดว่าจะได้รับอย่างชัดเจน (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 51,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีคำสั่งมอบหมายให้มีผู้รับผิดชอบดำเนินการจัดทำโครงการ กิจกรรม อบรม (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 52,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีหลักฐานการจัดโครงการ กิจกรรมตามแผน เช่น มีการบันทึกภาพนิ่ง ภาพเคลื่อนไหว (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 53,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการจัดทำปฏิทินโครงการ กิจกรรม รายปี (หากมีปฏิทินเป็นช่วงไม่ครบทั้งปี ตัดคะแนน) (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 54,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการรวบรวมสถิติผู้เข้ารับการอบรม เช่น เอกสารลงทะเบียนรายชื่อ เบอร์โทรศัพท์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 55,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีแฟ้มรวบรวมสภาพปัญหาที่ประชาชนแจ้ง เช่น คำร้อง บันทึกทางวิทยุ line ฯลฯ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 56,
    header: h2(
        "3.1 การเผยแพร่ความรู้ ความเข้าใจเพื่อปลูกฝังวินัยจราจรในสถานศึกษา หน่วยงานสถานประกอบการ หรือชุมชนในพื้นที่ เพื่อให้เข้าใจและเห็นถึงความสำคัญในการมีวินัยการจราจร รวมทั้งจัดทำโครงการ/กิจกรรมร่วมหารือกับชุมชนในพื้นที่อย่างสม่ำเสมอ เพื่อเปิดโอกาสให้ทุกชุมชนได้เข้ามามีส่วนร่วมในการแจ้งสภาพปัญหาและนำเสนอวิธีการแก้ไขเพื่อร่วมแก้ไขปัญหาจราจร (10 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้และปลูกจิตสำนึกในการรักษาวินัยจราจร"),
      formText(
          "และยุทธวิธีหนี ซ่อน สู้ ให้กับเยาวชนในสถานศึกษาหน่วยงานสถานประกอบการ หรือผู้ขับขี่และผู้ใช้รถในถนนตามชุมชนในพื้นที่ที่รับผิดชอบอย่างครอบคลุมทั่วถึง อย่างน้อยเดือนละครั้ง โดยจัดทำปฏิทินการทำงานไว้อย่างชัดเจนและรวบรวมสถิติของโครงการ/กิจกรรม ไว้เป็นหลักฐาน"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการขอรับการสนับสนุนงบประมาณจากแหล่งทุนอื่น เช่น สสส. กปถ. บ.กลางคุัมครอง ผู้ประสบภัยจากรถ สถาบันการศึกษา มูลนิธิองค์กรภาคเอกชนต่างๆ ตลอดจนหน่วยงานอื่นๆ ของรัฐ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีข้อมูลครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 57,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          จัดทำปฏิทินการทำงานโครงการ/กิจกรรม รายปี ไว้อย่างชัดเจน (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 58,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          ตรวจโครงการ/กิจกรรมการอบรมเผยแพร่ความรู้ ความเข้าใจกฎหมาย ระเบียบวินัยเกี่ยวกับงานจราจรว่าผู้เข้าร่วมโครงการ/กิจกรรม ให้ตรงกับกลุ่มเป้าหมาย (3 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 3,
        txt: "มีข้อมูลครบถ้วน (3 คะแนน)",
      ),
      Score_choice(
        score: 1.5,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 59,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("1) การจัดทำแผนการดำเนินโครงการ/กิจกรรม"),
      formText(
          "          มีคำสั่งมอบหมายให้มีผู้รับผิดชอบดำเนินการจัดทำโครงการ กิจกรรม อบรม (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 60,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          มีหลักฐานการจัดโครงการ กิจกรรมตามแผน เช่น มีสรุปผล การบันทึกภาพนิ่ง ภาพเคลื่อนไหว (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 61,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText("          มีการสรุปผล ติดตามประเมินผลโครงการอบรม (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 62,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          รวบรวมข้อมูลรายชื่อและหมายเลขโทรศัพท์ผู้ผ่านการอบรม และผู้ช่วยเหลืองานจราจร (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 63,
    header: h2(
        "3.2 แสวงหาความร่วมมือจากชุมชน และหน่วยงานอื่นๆ ให้เข้ามามีส่วนร่วมในการทำหน้าที่ช่วยเหลืองาน ด้านการจัดการจราจรในรูปแบบต่างๆ (15 คะแนน)",
        ""),
    widgets_1: [
      h3("จัดทำโครงการ/กิจกรรม อบรมให้ความรู้ความเข้าใจกฎหมายระเบียบ วินัย เกี่ยวกับงานจราจรให้กับกลุ่มเป้าหมายการฝึกอบรมเป็นผู้ช่วยงานจราจร อาสาจราจร อาสาสมัคร ตำรวจบ้าน (15 คะแนน)"),
      SizedBox(height: boxPadding),
      formText("2) การดำเนินการตามโครงการ/กิจกรรม"),
      formText(
          "          มีการประชาสัมพันธ์ แนะนำให้นำมาตรการองค์กรทั้งภาครัฐและเอกชน สถานประกอบการมาใช้ (2 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 2,
        txt: "มีข้อมูลครบถ้วน (2 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่ครบถ้วน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่ทำ (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 64,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText(
          "          มีข้อมูลเกี่ยวกับปัญหาการจราจร เช่น ระยะเวลาการก่อสร้างรถไฟฟ้า การวางระบบน้ำปะปา เป็นต้น (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 65,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีภาพถ่ายกิจกรรมการประชาสัมพันธ์ (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและเป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 66,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText(
          "          มีการประสานงานกับหน่วยพื้นที่ที่เกี่ยวข้อง (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 67,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีช่องทางของสื่อในการประชาสัมพันธ์ (0.5 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 0.5,
        txt: "มีและเป็นปัจจุบัน (0.5 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 68,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.1 ตรวจสอบกิจกรรมการประชาสัมพันธ์ ด้านงานจราจร เส้นทางจราจรที่สะดวกและปลอดภัย ในรูปแบบต่างๆ (3.5 คะแนน)"),
      formText(
          "เช่น ทางสื่อวิทยุชุมชน เสียงตามสายในชุมชน โทรทัศน์ สื่อทางโซเชียลมีเดีย ระบบไลน์ของภาคีเครือข่ายเกี่ยวกับอุบัติเหตุที่เกิดขึ้นป้ายประชาสัมพันธ์ต่างๆ สื่อสิ่งพิมพ์"),
      SizedBox(height: boxPadding),
      formText("          มีการประชาสัมพันธ์โครงการอาสาตาจราจร (1 คะแนน)"),
    ],
    widgets_2: [],
    choice: [
      Score_choice(
        score: 1,
        txt: "มีและเป็นปัจจุบัน (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มีหรือไม่เป็นปัจจุบัน (0 คะแนน)",
      ),
    ],
  ),
  Form_(
    id: 69,
    header: h2(
        "3.3 การประชาสัมพันธ์ให้ประชาชนทราบถึงการควบคุมและจัดการจราจร รวมทั้งการป้องกันและลดอุบัติเหตุทางถนน (5 คะแนน)",
        ""),
    widgets_1: [
      h3("3.3.2 รวบรวมปัญหาข้อร้องเรียน/ ข้อเสนอแนะ/ วิธีการแก้ไขจากสื่อต่างๆ จากประชาชน ชุมชน หน่วยงานที่เกี่ยวข้องไว้ทุกเดือน (1.5 คะแนน)"),
    ],
    widgets_2: [
      formRow("เกณฑ์การให้คะแนน",
          " มีข้อมูลเรื่องที่ร้องเรียน และการป้องกัน/แก้ไข เรื่องที่ร้องเรียนอย่างไรบ้าง")
    ],
    choice: [
      Score_choice(
        score: 1.5,
        txt: "มีข้อมูลและสมบูรณ์ (1.5 คะแนน)",
      ),
      Score_choice(
        score: 1,
        txt: "มีข้อมูลแต่ไม่สมบูรณ์ (1 คะแนน)",
      ),
      Score_choice(
        score: 0.0,
        txt: "ไม่มี (0 คะแนน)",
      ),
    ],
  ),
];
